Automating-the-ZAP-Scanner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-14 Sat 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-orgab7e624" class="outline-2">
<h2 id="orgab7e624">Automating the ZAP Scanner</h2>
<div class="outline-text-2" id="text-orgab7e624">
<p>
I normally use BurpSuite when doing web app penetration tests, but recently I've been trying out the <a href="https://www.owasp.org/index.php/OWASP_Zed_Attack_Proxy_Project">Zed Attack Proxy</a> and quite like it. Using some fancy python, I ran run a scan of an application using <code>ZAP</code> without putting traffic through it and opening up the application trough the proxy. <b>Note:</b> An application penetration is not just running tools and writing up the report, our tools help us see the lay of the land, but it takes a human to go in and poke around.
</p>
</div>

<div id="outline-container-org0a2c275" class="outline-3">
<h3 id="org0a2c275">Setup</h3>
<div class="outline-text-3" id="text-org0a2c275">
</div>
<div id="outline-container-orga356aad" class="outline-4">
<h4 id="orga356aad">Daemon</h4>
<div class="outline-text-4" id="text-orga356aad">
<p>
First we need to launch <code>ZAP</code>, if on a unix system you can run a headless server like so.
</p>

<div class="org-src-container">
<pre class="src src-shell">/path/to/zaproxy/installation/zap.sh -daemon -host 0.0.0.0 -port 8080 -config api.key=123456789 -config api.addrs.addr.name=<span style="font-style: italic;">".*"</span> -config api.addrs.addr.regex=true
</pre>
</div>

<p>
Any option could be reconfigured to meet your needs, in this example <code>ZAP</code> will accept any connection.
</p>
</div>
</div>
<div id="outline-container-orgf419aea" class="outline-4">
<h4 id="orgf419aea">Client</h4>
<div class="outline-text-4" id="text-orgf419aea">
<p>
Using the following <code>python</code> script, a scan of the application will take place, and you'll receive a <code>.xml</code> and <code>.html</code> report of the findings.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> sys
<span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">import</span> urllib3
<span style="font-weight: bold;">from</span> pprint <span style="font-weight: bold;">import</span> pprint
<span style="font-weight: bold;">from</span> zapv2 <span style="font-weight: bold;">import</span> ZAPv2
urllib3.disable_warnings()

<span style="font-weight: bold; font-style: italic;">apikey</span>= <span style="font-style: italic;">'123456789'</span>
<span style="font-weight: bold; font-style: italic;">app</span> = <span style="font-style: italic;">'http://scanme.nmap.org/'</span>
<span style="font-weight: bold; font-style: italic;">proxylocation</span> = <span style="font-style: italic;">'http://127.0.0.1:8080'</span>

<span style="font-weight: bold; font-style: italic;">zap</span> = ZAPv2(apikey=apikey, proxies={<span style="font-style: italic;">'http'</span>: proxylocation, <span style="font-style: italic;">'https'</span>: proxylocation})

<span style="font-weight: bold;">print</span> <span style="font-style: italic;">'[+] Accessing app %s'</span> % app
zap.urlopen(app)
time.sleep(2)

<span style="font-weight: bold;">print</span> <span style="font-style: italic;">'[+] Spidering app %s'</span> % app
scanid = zap.spider.scan(app)
time.sleep(2)
<span style="font-weight: bold;">while</span> (<span style="font-weight: bold;">int</span>(zap.spider.status(scanid)) &lt; 100):
    sys.stdout.write(<span style="font-style: italic;">'[+] Spider progress: '</span>+zap.spider.status(scanid)+<span style="font-style: italic;">'%\r'</span>)
    sys.stdout.flush()
    time.sleep(2)
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'\n[+] Spider completed'</span>
    time.sleep(5)

<span style="font-weight: bold;">print</span> <span style="font-style: italic;">'[+] Scanning app %s'</span> % app
scanid = zap.ascan.scan(app)
<span style="font-weight: bold;">while</span> (<span style="font-weight: bold;">int</span>(zap.ascan.status(scanid)) &lt; 100):
    sys.stdout.write(<span style="font-style: italic;">'[+] Scan progress: '</span>+ zap.ascan.status(scanid)+<span style="font-style: italic;">'%\r'</span>)
    sys.stdout.flush()
    time.sleep(5)
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'\n[+] Scan completed'</span>

f = <span style="font-weight: bold;">open</span>(zap.core.hosts[0]+<span style="font-style: italic;">'-xmlreport.xml'</span>,<span style="font-style: italic;">'w'</span>)
f2 = <span style="font-weight: bold;">open</span>(zap.core.hosts[0]+<span style="font-style: italic;">'-htmlreport.html'</span>,<span style="font-style: italic;">'w'</span>)
f.write(zap.core.xmlreport(apikey=apikey))
f2.write(zap.core.htmlreport(apikey=apikey))

f.close()
f2.close()

<span style="font-weight: bold;">print</span> <span style="font-style: italic;">'[+] wrote resutls to '</span>+zap.core.hosts[0]+<span style="font-style: italic;">'-xmlreport.xml'</span>
<span style="font-weight: bold;">print</span> <span style="font-style: italic;">'[+] wrote results to '</span>+zap.core.hosts[0]+<span style="font-style: italic;">'-htmlreport.html'</span>

zap.core.delete_all_alerts(apikey=apikey)
zap.core.delete_site_node(app,apikey=apikey)
</pre>
</div>

<pre class="example" id="org7532c50">
[+] Accessing app http://scanme.nmap.org/
[+] Spidering app http://scanme.nmap.org/
[+] Scanning app http://scanme.nmap.org/
[+] Scan progress: 0%
[+] Scan completed
[+] Scan progress: 3%
[+] Scan completed
[+] Scan progress: 5%
[+] Scan completed
[+] Scan progress: 9%
[+] Scan completed
[+] Scan progress: 15%
[+] Scan completed
[+] Scan progress: 26%
[+] Scan completed
[+] Scan progress: 42%
[+] Scan completed
[+] Scan progress: 45%
[+] Scan completed
[+] Scan progress: 46%
[+] Scan completed
[+] Scan progress: 52%
[+] Scan completed
[+] Scan progress: 55%
[+] Scan completed
[+] Scan progress: 57%
[+] Scan completed
[+] Scan progress: 58%
[+] Scan completed
[+] Scan progress: 68%
[+] Scan completed
[+] Scan progress: 79%
[+] Scan completed
[+] Scan progress: 87%
[+] Scan completed
[+] Scan progress: 93%
[+] Scan completed
[+] wrote resutls to scanme.nmap.org-xmlreport.xml
[+] wrote results to scanme.nmap.org-htmlreport.html
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae965fb" class="outline-3">
<h3 id="orgae965fb">Results</h3>
<div class="outline-text-3" id="text-orgae965fb">
<p>
The results output to a <code>.xml</code> and a <code>.html</code> file that you can parse or view.
</p>

<div class="org-src-container">
<pre class="src src-shell">file ./scanme.nmap.org*
</pre>
</div>

<pre class="example">
./scanme.nmap.org-htmlreport.html: HTML document, ASCII text, with very long lines
./scanme.nmap.org-xmlreport.xml:   XML 1.0 document, ASCII text, with very long lines, with CRLF, LF line terminators
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
